import AOS from 'aos';
import 'aos/dist/aos.css'; // You can also use <link> for styles

const Jikir = () => {

    AOS.init();

    return (
        <div className="w-3/4 mx-auto my-10">
            <div>
                <marquee direction="left" className='text-green-600'>জিকিরের মধ্যে ‘সুবহানাল্লাহ, আলহামদুলিল্লাহ, লা ইলাহা ইল্লাল্লাহ, আল্লাহু আকবার, লা হাওলা ওয়ালা কুয়্যাতা ইল্লা বিল্লাহ, বিসমিল্লাহ, হাসবুনাল্লাহ, আসতাগফিরুল্লাহসহ দুনিয়া ও পরকালের কল্যাণ কামনায় যে কোনো দোয়া করাই জিকিরের শামিল। এ ছাড়াও নিয়মিত ফরজ নামাজ ও কাজ, কুরআন তেলাওয়াত, জ্ঞানার্জন এবং নফল নামাজ আদায় করাকেও জিকির হিসেবে গন্য করা হয়। জিকির শুধুমাত্র মানুষের জিহ্বার উচ্চারণের মাধ্যমেও হতে পারে। আবার জিহ্বার উচ্চারণের সঙ্গে সঙ্গে অন্তরের স্মরণ বা উপলব্দি সংযুক্ত হলে তা উত্তম ও পরিপূর্ণতার জিকিরে পরিণত হবে। অন্তরের স্মরণের সঙ্গে সঙ্গে যদি জিকিরের অর্থ উপলব্দি করে মুমিন তবে তা হবে আরো উত্তম এবং ফজিলতপূর্ণ। সুতরাং জিকির জিহ্বার দ্বারা উচ্চারণ হোক আর অন্তরের স্মরণের সঙ্গে হোক কিংবা অর্থ উপলব্দির মাধ্যমেই হোক, সব ধরনের জিকিরেই সাওয়াব পাবে মুমিন। সাওয়াব পাওয়ার জন্য অন্তরের সম্পর্ক ও অর্থের সম্পর্ক জরুরি নয়। তবে পরিপূর্ণ ও উত্তম জিকিরের জন্য এসবই প্রযোজ্য।</marquee>
                <h3 data-aos="fade-up" className="text-2xl md:text-3xl font-semibold mt-10 text-center">জিকির</h3>
                <p data-aos="fade-up" className="mt-6 text-lg text-justify">জিকির বা যিকর অর্থ হল স্মরণ করা বা উল্লেখ করা। এটি হলো ইসলাম ধর্মের প্রার্থনার মাধ্যম যাতে আল্লাহকে স্মরণ করার জন্য বিশেষ কিছু শব্দ বা বাক্যাংশ বারবার উচ্চারণ করা হয়। জিকিরের মাধ্যমে ইসলাম ধর্মাবলম্বীরা আল্লাহকে স্মরণ করে থাকে। জিকির শব্দটি আরবী ভাষার “ذِكْر ” ( যিকরুন) থেকে এসেছে।</p>
            </div>
            <div>
                <h3 data-aos="fade-up" className="text-2xl md:text-3xl font-semibold mt-12 text-center">আল্লাহর কাছে পছন্দনীয় শ্রেষ্ঠ কিছু যিকির ও দোয়া</h3>
                <p data-aos="fade-up" className="mt-6 text-lg text-justify">মহান আল্লাহপাক তাঁর বান্দাদের জন্য  যখন তখন সারাক্ষণ নেক আমলের সুবর্ণ সুযোগ করে দিয়েছেন। যুগে যুগে আল্লাহ প্রেমিকরা আল্লাহর যিকিরে সাড়া দিয়ে সর্বক্ষণ অন্তরে আল্লাহর নাম স্মরণ করে সাধনা করেছেন। যথাসম্ভব জিহ্বা দিয়ে তাঁর যিকির করেছেন ও কাজের মধ্যে ও আল্লাহর সচেতনতাকে ধারণ করেছেন। বিনিময়ে তারা আল্লাহর সান্নিধ্যে ধন্য হয়েছেন। এভাবে আল্লাহকে অধিক হারে স্মরণের মধ্যে দিয়ে যে কেউ কিয়ামতের দিন আল্লাহর সবচেয়ে নৈকট্যশীলদের অন্তর্ভুক্ত হয়ে যেতে পারে। আল্লাহর নৈকট্য লাভের জন্য অসংখ্য যিকির ও দোয়া রয়েছে।</p>
                <p data-aos="fade-right" className="mt-8 text-lg text-justify font-semibold">রাসুলুল্লাহ (সঃ) বলেন, আল্লহর নিকট সর্বাপেক্ষা প্রিয় বাক্য চারটি। আর এই চারবাক্য পাঠ করা তাঁর কাছে সমগ্র পৃথিবী অপেক্ষা প্রিয়।</p>
                <ul data-aos="fade-right" className="list-disc ml-4 mt-2 text-lg">
                    <li>সুবহানাল্লাহ</li>
                    <li>আলহামদুলিল্লাহ</li>
                    <li>লা ইলাহা ইল্লাল্লাহ</li>
                    <li>আল্লাহু আকবার <i>(মুসলিম হাদিস নং ৩৯৮৫)</i></li>
                </ul>
                <p data-aos="fade-up" className="mt-4 text-lg text-justify">রাসুলুল্লাহ (সঃ) প্রত্যেক ফরজ সালাতের পর ও ঘুমানোর পূর্বে <b>সুব হা-নাল্লাহ ৩৩ বার</b>, <b>আল-হামদুলিল্লাহ্‌ ৩৩ বার</b> এবং <b>আল্লাহু আকবার ৩৪ বার</b> পড়তে বলেছেন।

                    রাসুলুল্লাহ (সঃ) বলেন, শ্রেষ্ঠ যিকির হল, <b>লা-ইলাহা ইল্লাল্লা-হ</b>, শ্রেষ্ঠ দোয়া হল, <b>আল-হামদুলিল্লাহ্</b>‌। যে ব্যক্তি প্রত্যহ <b>১০০ বার সুব হা-নাল্লাহ</b> বলবে তাঁর জন্য একহাজার গুনাহ ক্ষমা করা হবে।

                    আবু হুরায়রা (রাঃ) বলেন, রাসুলুল্লাহ (সঃ) বলেছেনঃ দুটি কাজ এমন যে মুখে উচ্চারণ করা অতি সহজ, পাল্লায় অনেক ভারী। আর আল্লাহ্র‌ নিকট অতি প্রিয়। তা হল, <b>সুবহা-নাল্লা-হি, ওয়া বিহামদিহি- সুবহা-নাল্লাহিল আযীম</b>। <i>(বুখারী হাদিস নং ৫৯৫১, মুসলিম হাদিস নং ৬৬০১)</i>।</p>
            </div>
        </div>
    );
};

export default Jikir;